//
// Created by 13129 on 2022/3/3.
//
#include <stdio.h>
//void test1(int arr[])
//{
//    printf("%d\n",sizeof(arr));//4 //函数接收数组接受的时第一个元素的地址，地址的大小为8个字节，同理test2也应为8
//}
//void test2(int ch[])
//{
//    printf("%d\n",sizeof(ch));//1
//}
//int main()
//{
//    //~波浪号操作符
////    int a=11;
////    int b=a|1<<2;
////    printf("%d\n",b);
////    b=a&(~(1<<2));
////    printf("%d\n",b);
//    //++加加操作符
////    int a=10;
////    printf("%d\n",++a);
////    printf("%d\n",a++);
//    //()强制类型转换
////    int a=(int)3.14;
////    printf("%d\n",a);
//    //sizeof 练习
//    //int arr[10]={0};
////      char ch[10]={0};
////    printf("%d\n",sizeof (arr));//40
////    printf("%d\n",sizeof (ch));//10
////    test1(arr);
////    test2(ch);
//    //，逗号表达式
//    //代码1
////    int a=1;
////    int b=2;
////    int c=(a>b,a=b+10,a,b=a+1);
////    printf("%d\n",c);
//    //代码2
////    int a=1;
////    int b=2;
////    int c;
////    if(a=b+1,c=a/2,b>0)
//    //代码3
////    int a=get_val();//获取值赋给a
////    count_val(a);//对a进行处理
////    while (a>0){
////        a=get_val();
////        count_val(a);
////    }
////    //代码用逗号表达式改写为
////    while (a=get_val(),count_val(a),a>0){
////        //用逗号表达式对代码优化
////    }
//      //下标引用操作符
////      int a[10]={0};//创建数组
////      a[4]=10;//利用下标引用操作符 操作元素
//
//    return 0;
//}
//函数调用操作符
//int get_max(int x,int y)
//{
//    return x>y?x:y;
//}
//int main()
//{
//    int a=10;
//    int b=20;
//    int max=get_max(a,b);//调用函数的时候（）就是函数调用操作符，（）操作数有函数名，两个实参，至少要有一个操作数
//    printf("max=%d\n",max);
//    return 0;
//}
////.访问结构体成员
////创建学生结构体
////创建一个结构体类型-struct stu
//struct stu
//{
//    char name[20];
//    int age;
//    char id[20];
//};
//int main()
//{
//    //使用struct stu这个类型创建了一个学生对象s1，并初始化
//    struct stu s1={"张三",20,"2019010315"};
//    printf("%s\n",s1.name);//结构体.成员名
//    printf("%d\n",s1.age);
//    printf("%s\n",s1.id);
//    struct stu* ps=&s1;//创建一个结构体指针变量
//    printf("%s\n",(*ps).name);//利用结构体指针变量来找到结构体的内容大致写法为（*指针）.结构体成员名
//    printf("%s\n",ps->id);//此为简化写法
//    return 0;
//}
//int main()
//{
//    //char 大小只有一个字节=8个比特位
//    char a=3;
//    //00000000000000000000000000000011//结果被截断
//    //00000011-a
//    char b=127;
//    //00000000000000000000000001111111//被截断
//    //01111111-b
//    char c=a+b;
//    //a和b如何相加
//    //00000000000000000000000000000011
//    //00000000000000000000000001111111
//    //00000000000000000000000010000010//被截断
//    //10000010-c
//    //因为%d是打印整形，所以c要进行整形提升，高位补充符号位
//    //11111111111111111111111110000010-在内存以补码形式存储
//    //11111111111111111111111110000001-减一换算为反码
//    //10000000000000000000000001111110-符号位不变其他位取反
//    //-126-c
//    printf("%d\n",c);//结果为-126
//    //在进行运算时 因为a,b的大小都为char类型
//    //大小未达到一个整形的大小，所以在计算时
//    //为了能提高计算精度，会发生整型提升
//    return 0;
//}
//int main()
//{
//    char c=1;
//    printf("%u\n",sizeof (c));
//    printf("%u\n",sizeof (+c));
//    printf("%u\n",sizeof (!c));
//    return 0;
//
//}
//int main()
//{
//    int a=10;
//    int b=20;
//    int c=b+b*a;
//    return 0;
//}