//
// Created by 13129 on 2021/9/18.
//

#include <stdio.h>
int main()
{
    //exp1?exp2:exp3;条件操作符也叫三目运算符
    int a=10;
    int b=20;
    int max=0;
    max=(a>b?a:b);//意思为a大于b嘛？如果a>b那么就执行a，反之就执行b
   /* if(a>b)
        max=a;
    else
        max=b;*/
    printf("%d",max);
    return 0;
}
/*int main()
{
    //&&逻辑与操作符,有0出0，全一出一
    int a=0;//在二进制里
    int b=0;//0为假，一切非零都为真
    //int c=a&&b;//逻辑与表示全一出一
    //||逻辑或操作符，有1出1，全0出0
    int c=a||b;

    printf("%d",c);
    return 0;
}*/
/*int main()
{
    int a=10;
    //int b=a++;//后置++，先赋值，在使用，先把a的值赋予给b，b=10；然后a再自增得到a=11
    int b=++a;//前置++，先自增，再使用，a自增过后变成11，再把11赋予给b就得到了b=11,同样a=11
    //int a=10;
    //int b=a--;//效果同a++一样
    //int b=--a;//效果同++a一样
    printf("a=%d\nb=%d\n",a,b);
    return 0;
}*/
/*
int main()
{
    int a=0;//4字节，32比特位
    int b=~a;//b是有符号的整形，符号位1表示负数，0为正数
    //源码；111111；符号位不变，其他位按位取反得到反码；100000
    //反码；100000；反码+1得到补码；100001
    //补码；100001；补码-1得到反码；100000
    //反码；100000；符号位不变；按位取反得到源码；1111111
    //源码；111111
    printf("%d",b);
    //使用的输出的是这个数的源码

    return 0;
}*/
